package day18;

public class CW02_10 {
    public static void main(String[] args) {
        //Школа и геометрия
        //Школа приняла на работу молодую учительницу геометрии. 
        //И первым делом она решила привести кабинет точных наук в порядок. В подвале школы были найдены:
        //точная копия спутника земли ПС-1. Диаметр сферы 58см.
        //жестяной куб со стороной 40см.
        //правильная четырёхугольная пирамида "Хеопса" со стороной основания 20см и боковыми рёбрами 30см и чёрный ящик 
        //с размерами 80см * 30см * 20см.
        //Всё было в достаточно запущенном состоянии и новая учительница решила всё покрасить в красный цвет.
        //Сколько денег на покраску нужно потратить если на один квадратный метр надо 560мл краски, 
        //а балончик с аэрозольной краской 400мл стоит 17€?
        paint();
    }

    private static void paint() {
    }
}
