package day9.hw;

public class HW9_4 {
    public static void main(String[] args) {
        //Выведите на экран первые 11 членов последовательности Фибоначчи.
        //первый и второй члены последовательности равны единицам
        //а каждый следующий — сумме двух предыдущих
        //То есть числа Фибоначчи - это 1 1 2 3 5 8 13 21 34 55 89 и т.д.
        FibonacciSequence(100);
    }

    private static void FibonacciSequence(int digit) {
       /* int temp
        for (int i =0; i<9; i++){
            System.out.println(n1+" ");
            System.out.println(n2+" ");
            int temp =n2;
            n1=n1+n2;
            n2=n2;*/
        }
    }

/*int i = 1;
    int i1 =1;
        for (i = 1; i < digit; i++) {
        System.out.print(i);
        }
        return 0;*/
